# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [4]:
a = pd.DataFrame({'A':[1,2,nan]})

NameError: name 'nan' is not defined

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
#it will delete every record containing NaN,by default it is row wise
df.dropna()

     A    B  C
0  1.0  5.0  1

In [9]:
#it will delete every coln conatining NaN
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [10]:
#i  can even specify how much NaNs can be handeled
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [11]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [12]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [14]:
# it is not affecting orginal df
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
#if we want to replace NaN with some value use fillna
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [16]:
#we replace Nan with the mean value of given coln this is what we do in ML
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Great Job!